performance-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Java
Server Hostname:        localhost
Server Port:            8888

Document Path:          /pdf-sample.pdf
Document Length:        7945 bytes

Concurrency Level:      25
Time taken for tests:   0.979 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      8094000 bytes
HTML transferred:       7945000 bytes
Requests per second:    1021.19 [#/sec] (mean)
Time per request:       24.481 [ms] (mean)
Time per request:       0.979 [ms] (mean, across all concurrent requests)
Transfer rate:          8071.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3   24  30.7     19     201
Waiting:        2   23  26.8     18     173
Total:          3   24  30.8     19     202

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     24
  75%     27
  80%     30
  90%     35
  95%     51
  98%    199
  99%    200
 100%    202 (longest request)


Server Software:        Java
Server Hostname:        localhost
Server Port:            8888

Document Path:          /asf-logo.gif
Document Length:        7279 bytes

Concurrency Level:      25
Time taken for tests:   0.979 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      7422000 bytes
HTML transferred:       7279000 bytes
Requests per second:    1021.13 [#/sec] (mean)
Time per request:       24.483 [ms] (mean)
Time per request:       0.979 [ms] (mean, across all concurrent requests)
Transfer rate:          7401.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     4   24  30.8     19     201
Waiting:        3   23  27.0     18     174
Total:          4   24  30.8     19     201

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     24
  75%     27
  80%     30
  90%     36
  95%     55
  98%    198
  99%    200
 100%    201 (longest request)